In [2]:
import pandas as pd
from pypdfium2_raw import JSPLATFORM_ALERT_ICON_STATUS

df = pd.DataFrame({
    "city":['Tashkent','Tashkent','Bukhara','Bukhara'],
    "sales":[100,150,120,130]
})
print(df.head())

       city  sales
0  Tashkent    100
1  Tashkent    150
2   Bukhara    120
3   Bukhara    130

In [3]:
df.groupby('city')['sales'].sum()

city
Bukhara     250
Tashkent    250
Name: sales, dtype: int64

In [4]:
df.groupby('city')['sales'].mean()

city
Bukhara     125.0
Tashkent    125.0
Name: sales, dtype: float64

In [7]:
df.groupby('city')['sales'].agg(['sum','mean','max','min'])

          sum   mean  max  min
city
Bukhara   250  125.0  130  120
Tashkent  250  125.0  150  100

In [8]:
df.describe()

           sales
count    4.00000
mean   125.00000
std     20.81666
min    100.00000
25%    115.00000
50%    125.00000
75%    135.00000
max    150.00000

In [9]:
sales_df = pd.read_csv('sales.csv')
sales_df.head()

        city product  sales
0  Bengaluru       A  100.0
1  Bengaluru       B    NaN
2    Chennai       A  120.0
3    Chennai       B  130.0